app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    # a = '222'
    # binding.pry
    @clients = Client.all

INSERT INTO `clients` (`username`, `sex`, `created_at`, `updated_at`) VALUES ('aa', '男', '2019-07-12 03:51:44', '2019-07-12 03:51:44')
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
    def set_client
      @client = Client.find(params[:id])