app/controllers/lists_controller.rb

  def index
    @lists = List.all.with_attached_atfile
---
SELECT `lists`.* FROM `lists`

  def create
    @list = List.new(list_params)
    @list.atfile.attach(params[:list][:atfile]) if params[:list][:atfile].present?
---
INSERT INTO `lists` (`name`, `idcard`, `phone`, `created_at`, `updated_at`) VALUES ('aaa', '123', '123456789', '2019-07-12 03:21:24', '2019-07-12 03:21:24')

    def set_list
      @list = List.find(params[:id])
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1